class script(object):
    START_TXT = """<b>ʜᴇʏ  {} ʙʀᴏ! \n
ᴍʏ ɴᴀᴍᴇ ɪꜱ  <a href=https://t.me/Imbd_Evabot><b>『 χєяσχ-𝚉™ 』</b></a>  ɪ ᴄᴀɴ ᴘʀᴏᴠɪᴅᴇ ʏᴏᴜ ᴍᴏᴠɪᴇꜱ ᴊᴜꜱᴛ ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ ᴀɴᴅ ꜱᴇᴇ ᴍʏ ᴘᴏᴡᴇʀ 🕊️</b>"""   
   
    OWNER_TXT2 = """<b>⍟───[ ᴏᴡɴᴇʀ ᴅᴇᴛᴀɪʟꜱ ]───⍟
    
• ꜰᴜʟʟ ɴᴀᴍᴇ : ᴍᴏᴠɪᴇ ʜᴜʙ
• ᴜꜱᴇʀɴᴀᴍᴇ : @MoviesHubGroup2
• ᴘᴇʀᴍᴀɴᴇɴᴛ ᴅᴍ ʟɪɴᴋ : <a href=https://t.me/MoviesHubGroup2>ᴄʟɪᴄᴋ ʜᴇʀᴇ</a>

⍟───[ 💭 ᴍᴏᴠɪᴇ ʜᴜʙ 💭 ]───⍟</b>

• ꜰᴜʟʟ ɴᴀᴍᴇ : ᴛᴇᴀᴍ ᴇᴠᴀᴍᴀʀɪᴀ
• ᴛᴇᴀᴍ ʟɪɴᴋ : <a href=https://t.me/TeamEvaMaria>ᴛᴇᴀᴍ ᴇᴠᴀᴍᴀʀɪᴀ</a></b>"""

    ENGLISHSPELL_TXT = f"<b>𝖲ᴏʀʀʏ 𝖭ᴏ 𝖥ɪʟᴇ𝗌 𝖶ᴇʀᴇ 𝖥ᴏᴜɴᴅ.\n\n𝖢ʜᴇᴄᴋ 𝖸ᴏᴜʀ 𝖲ᴘᴇʟʟɪɴɢ ɪɴ 𝖦ᴏᴏɢʟᴇ ᴀɴᴅ 𝖳ʀʏ 𝖠ɢᴀɪɴ. ♻️\n\n𝖱ᴇᴀᴅ 𝖨ɴ𝗌ᴛʀᴜᴄᴛɪᴏɴ𝗌 ғᴏʀ ʙᴇᴛᴛᴇʀ 𝖱ᴇ𝗌ᴜʟᴛ𝗌 👇🏻</b>"
    MAL_TXT = """
<b>താങ്കൾ ആവശ്യപ്പെട്ട ഫയൽ എനിക്ക് കണ്ടെത്താനായില്ല 😕
താഴെ പറയുന്ന കാര്യങ്ങളിൽ ശ്രദ്ധിക്കുക...

=> കറക്റ്റ് സ്പെല്ലിംഗിൽ ചോദിക്കുക.

=> ഒ.ടി.ടി പ്ലാറ്റ്ഫോമുകളിൽ റിലീസ് ആകാത്ത സിനിമകൾ ചോദിക്കരുത്.

=> കഴിവതും [സിനിമയുടെ പേര്, ഭാഷ] ഈ രീതിയിൽ ചോദിക്കുക.</b>
"""  
    ENG_TXT = """
<b>I could not find the file you requested 😕
Pay attention to the following…

=> Ask for correct spelling.

=> Do not ask for movies that are not released on OTT platforms.</b>
"""
    HND_TXT = """
<b>मुझे आपके द्वारा अनुरोधित फ़ाइल नहीं मिली 🙁
निम्नलिखित बातों पर ध्यान दें…

=> सही वर्तनी के लिए पूछें।

=> उन फिल्मों के बारे में न पूछें जो ओटीटी प्लेटफॉर्म पर रिलीज नहीं होती हैं।</b>
"""
    TML_TXT = """
<b>நீங்கள் கோரிய கோப்பை என்னால் கண்டுபிடிக்க முடியவில்லை 😕
பின்வருவனவற்றில் கவனம் செலுத்துங்கள்…

=> சரியான எழுத்துப்பிழை கேட்கவும்.

=> OTT இயங்குதளங்களில் வெளியிடப்படாத திரைப்படங்களைக் கேட்க வேண்டாம்.</b>
"""
    
    SPELL_TXT = '<b>🤝 ᴄʜᴏᴏꜱᴇ ʏᴏᴜʀ ᴍᴏᴛʜᴇʀ ᴛᴏᴜɴɢᴇ ᴀɴᴅ ʀᴇᴀᴅ ᴛʜᴇ ɪɴꜱᴛʀᴜᴄᴛɪᴏɴꜱ..👇\n\n🤝 ᴏʀ ꜱᴇᴀʀᴄʜ ɪᴛ ᴏɴ ɢᴏᴏɢʟᴇ ᴜꜱɪɴɢ ᴛʜᴇ ɢᴏᴏɢʟᴇ ʙᴜᴛᴛᴏɴ\n\n🤝 ᴏʀ ʀᴇQᴜᴇꜱᴛ ʜᴇʀᴇ 👉 <a href=https://t.me/MoviesHubGroup2>◥Moviehub 𝐌𝐇™◤</a></b>'

    OWNER_TXT = """<b>⍟───[ ᴏᴡɴᴇʀ ᴅᴇᴛᴀɪʟꜱ ]───⍟
    
• ꜰᴜʟʟ ɴᴀᴍᴇ : ᴍᴏᴠɪᴇ ʜᴜʙ
• ᴜꜱᴇʀɴᴀᴍᴇ : @MoviesHubGroup2
• ᴘᴇʀᴍᴀɴᴇɴᴛ ᴅᴍ ʟɪɴᴋ : <a href=https://t.me/MoviesHubGroup2>ᴄʟɪᴄᴋ ʜᴇʀᴇ</a>

⍟───[ 💭 ᴍᴏᴠɪᴇ ʜᴜʙ 💭 ]───⍟</b>
"""
    HELP_TXT = """<b>ʜᴇʏ  {} ʙʀᴏ! \n
ʜᴇʀᴇ ɪꜱ ᴛʜᴇ ʜᴇʟᴘ ꜰᴏʀ ᴍʏ ᴄᴏᴍᴍᴀɴᴅꜱ."""

    ABOUT_TXT = """<b>🤖 ᴍʏ ɴᴀᴍᴇ : <a href=https://t.me/Imbd_Evabot>χєяσχ-𝚉™</b></a>
👨‍💻 <b>ᴅᴇᴠᴇʟᴏᴘᴇʀ : <a href=https://t.me/TeamEvamaria>Team Eva Maria</a></b>
📝 <b>ʟᴀɴɢᴜᴀɢᴇ : <a href=https://t.me/UrvashiTheaters>𝙿𝚈𝚃𝙷𝙾𝙽 𝟹</a></b>
💾 <b>ᴅᴀᴛᴀ ʙᴀꜱᴇ : <a href=https://t.me/UrvashiTheaters>𝙼𝙾𝙽𝙶𝙾 𝙳𝙱</a></b>
📡 <b>ʙᴏᴛ ꜱᴇʀᴠᴇʀ : <a href=https://t.me/UrvashiTheaters>𝙷𝙴𝚁𝙾𝙺𝚄</a></b>
🛠️ <b>ʙᴜɪʟᴅ ꜱᴛᴀᴛᴜꜱ : <a href=https://t.me/UrvashiTheaters>v1.0.1 [ 𝙱𝙴𝚃𝙰 ]</b></a>"""

    SOURCE_TXT = """<b>NOTE:</b>
- Eva Maria is a open source project. 
- Source - https://github.com/EvamariaTG/EvaMaria  

<b>DEVS:</b>
- <a href=https://t.me/TeamEvamaria>Team Eva Maria</a>"""
    MANUELFILTER_TXT = """<u><b>ᴍᴀɴᴜᴀʟ ꜰɪʟᴛᴇʀꜱ</b></u>

- ꜰɪʟᴛᴇʀ ɪꜱ ᴛʜᴇ ꜰᴇᴀᴛᴜʀᴇ ᴡᴇʀᴇ ᴜꜱᴇʀꜱ ᴄᴀɴ ꜱᴇᴛ ᴀᴜᴛᴏᴍᴀᴛᴇᴅ ʀᴇᴘʟɪᴇꜱ ꜰᴏʀ ᴀ ᴘᴀʀᴛɪᴄᴜʟᴀʀ ᴋᴇʏᴡᴏʀᴅ ᴀɴᴅ χєяσχ-𝚉™ ᴡɪʟʟ ʀᴇꜱᴘᴏɴᴅ ᴡʜᴇɴᴇᴠᴇʀ ᴀ ᴋᴇʏᴡᴏʀᴅ ɪꜱ ꜰᴏᴜɴᴅ ᴛʜᴇ ᴍᴇꜱꜱᴀɢᴇ

<b><u>ʀᴇQᴜɪʀᴇᴍᴇɴᴛꜱ</u></b>
1. ƈɨռɖɛʀɛʟʟǟ™ 𝚜𝚑𝚘𝚞𝚕𝚍 𝚑𝚊𝚟𝚎 𝚊𝚍𝚖𝚒𝚗 𝚙𝚛𝚒𝚟𝚒𝚕𝚕𝚊𝚐𝚎.
2. 𝚘𝚗𝚕𝚢 𝚊𝚍𝚖𝚒𝚗𝚜 𝚌𝚊𝚗 𝚊𝚍𝚍 𝚏𝚒𝚕𝚝𝚎𝚛𝚜 𝚒𝚗 𝚊 𝚌𝚑𝚊𝚝.
3. 𝚊𝚕𝚎𝚛𝚝 𝚋𝚞𝚝𝚝𝚘𝚗𝚜 𝚑𝚊𝚟𝚎 𝚊 𝚕𝚒𝚖𝚒𝚝 𝚘𝚏 𝟼𝟺 𝚌𝚑𝚊𝚛𝚊𝚌𝚝𝚎𝚛𝚜.

<b><u>ᴄᴏᴍᴍᴀɴᴅꜱ ᴀɴᴅ ᴜꜱᴀɢᴇ</u></b>
• /filter - <code>add a filter in chat</code>
• /filters - <code>list all the filters of a chat</code>
• /del - <code>delete a specific filter in chat</code>
• /delall - <code>delete the whole filters in a chat (chat owner only)</code>"""
    BUTTON_TXT = """<b><u>ʙᴜᴛᴛᴏɴꜱ</b></u>

- ƈɨռɖɛʀɛʟʟǟ™ 𝚂𝚞𝚙𝚙𝚘𝚛𝚝𝚜 𝚋𝚘𝚝𝚑 𝚞𝚛𝚕 𝚊𝚗𝚍 𝚊𝚕𝚎𝚛𝚝 𝚒𝚗𝚕𝚒𝚗𝚎 𝚋𝚞𝚝𝚝𝚘𝚗𝚜.

<b>NOTE:</b>
1. 𝚃𝚎𝚕𝚎𝚐𝚛𝚊𝚖 𝚠𝚒𝚕𝚕 𝚗𝚘𝚝 𝚊𝚕𝚕𝚘𝚠𝚜 𝚢𝚘𝚞 𝚝𝚘 𝚜𝚎𝚗𝚍 𝚋𝚞𝚝𝚝𝚘𝚗𝚜 𝚠𝚒𝚝𝚑𝚘𝚞𝚝 𝚊𝚗𝚢 𝚌𝚘𝚗𝚝𝚎𝚗𝚝, 𝚜𝚘 𝚌𝚘𝚗𝚝𝚎𝚗𝚝 𝚒𝚜 𝚖𝚊𝚗𝚍𝚊𝚝𝚘𝚛𝚢.
2. ƈɨռɖɛʀɛʟʟǟ™ 𝚜𝚞𝚙𝚙𝚘𝚛𝚝𝚜 𝚋𝚞𝚝𝚝𝚘𝚗𝚜 𝚠𝚒𝚝𝚑 𝚊𝚗𝚢 𝚝𝚎𝚕𝚎𝚐𝚛𝚊𝚖 𝚖𝚎𝚍𝚒𝚊 𝚝𝚢𝚙𝚎.
3. 𝙱𝚞𝚝𝚝𝚘𝚗𝚜 𝚜𝚑𝚘𝚞𝚕𝚍 𝚋𝚎 𝚙𝚛𝚘𝚙𝚎𝚛𝚕𝚢 𝚙𝚊𝚛𝚜𝚎𝚍 𝚊𝚜 𝚖𝚊𝚛𝚔𝚍𝚘𝚠𝚗 𝚏𝚘𝚛𝚖𝚊𝚝.

<b><u>ᴜʀʟ ʙᴜᴛᴛᴏɴꜱ</u></b>
<code>[Button Text](buttonurl:link)</code>

<b><u>ᴀʟᴇʀᴛ ʙᴜᴛᴛᴏɴꜱ</u></b>
<code>[Button Text](buttonalert:This is an alert message)</code>"""
    AUTOFILTER_TXT = """<b><u>ᴀᴜᴛᴏ ꜰɪʟᴛᴇʀ</u></b>

<b><u>ᴍᴜꜱᴛ ʀᴇᴀᴅ</u></b>
1.<b> നിങ്ങൾക്ക്  സിനിമ ഗ്രൂപ്പ്‌ ഉണ്ടോ സിനിമ ഫയലുകൾ സെർച്ച്‌ ചെയ്ത് കണ്ട് പിടിച്ചു ഗ്രൂപ്പിൽ അയച്ചു ബുദ്ധിമുട്ടുന്നുണ്ടോ....ഇനി ഒന്നുകൊണ്ടും പേടിക്കണ്ട....</b>
2. <b><a href=https://t.me/Imbd_Evabot?startgroup=true><b>➕️ ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ ➕️</b></a>എന്ന ലിങ്കിലോ ബട്ടണിലോ ക്ലിക്ക് ചെയ്ത് ബോട്ട് ഗ്രൂപ്പിൽ അഡ്മിൻ ആകുക...</b>
3. <b>പിന്നെ സിനിമകൾ എല്ലാം ബോട്ട് തരുന്നതായിരിക്കും</b>

<b><u>ᴍᴜꜱᴛ ʀᴇᴀᴅ[ᴇɴɢ]</u></b>
1.<b>𝙸𝚝𝚜 𝚅𝚎𝚛𝚢 𝙴𝚊𝚜𝚢..𝙹𝚞𝚜𝚝  <a href=https://t.me/Imbd_Evabot?startgroup=true><b>ᴀᴅᴅ ᴍᴇ ᴛᴏ ʏᴏᴜʀ ɢʀᴏᴜᴘ</b></a> 𝚆𝚒𝚝𝚑 𝙰𝚍𝚖𝚒𝚗 𝚁𝚒𝚐𝚑𝚝𝚜.. </b>
2.<b>𝚃𝙷𝙴𝙽 𝙸 𝚆𝚒𝚕𝚕 𝙿𝚛𝚘𝚟𝚒𝚍𝚎 𝙼𝚘𝚟𝚒𝚎𝚜 𝚃𝚑𝚎𝚛𝚎...</b>
3.<b><u>𝙽𝙱 </u>:𝙱𝙾𝚃 𝙼𝚄𝚂𝚃 𝙱𝙴 𝙸𝙽 𝙰𝙳𝙼𝙸𝙽 𝙾𝙽 𝙶𝚁𝙾𝚄𝙿..</b>
"""
    CONNECTION_TXT = """Help: <b>Connections</b>

- Used to connect bot to PM for managing filters 
- it helps to avoid spamming in groups.

<b>NOTE:</b>
1. Only admins can add a connection.
2. Send <code>/connect</code> for connecting me to ur PM

<b>Commands and Usage:</b>
• /connect  - <code>connect a particular chat to your PM</code>
• /disconnect  - <code>disconnect from a chat</code>
• /connections - <code>list all your connections</code>"""
    EXTRAMOD_TXT = """Help: <b>Extra Modules</b>

<b>NOTE:</b>
these are the extra features of Eva Maria

<b>Commands and Usage:</b>
• /id - <code>get id of a specified user.</code>
• /info  - <code>get information about a user.</code>
• /imdb  - <code>get the film information from IMDb source.</code>
• /search  - <code>get the film information from various sources.</code>"""
    ADMIN_TXT = """Help: <b>Admin mods</b>

<b>NOTE:</b>
This module only works for my admins

<b>Commands and Usage:</b>
• /logs - <code>to get the rescent errors</code>
• /stats - <code>to get status of files in db.</code>
• /delete - <code>to delete a specific file from db.</code>
• /users - <code>to get list of my users and ids.</code>
• /chats - <code>to get list of the my chats and ids </code>
• /leave  - <code>to leave from a chat.</code>
• /disable  -  <code>do disable a chat.</code>
• /ban  - <code>to ban a user.</code>
• /unban  - <code>to unban a user.</code>
• /channel - <code>to get list of total connected channels</code>
• /broadcast - <code>to broadcast a message to all users</code>"""
    STATUS_TXT = """<b>🗂️ ᴛᴏᴛᴀʟ ғɪʟᴇs: <code>{}</code>
👤 ᴛᴏᴛᴀʟ ᴜsᴇʀs: <code>{}</code>
👥 ᴛᴏᴛᴀʟ ᴄʜᴀᴛs: <code>{}</code>
📈 ᴜsᴇᴅ sᴛᴏʀᴀɢᴇ: <code>{}</code>
📊 ғʀᴇᴇ sᴛᴏʀᴀɢᴇ: <code>{}</code>

⍟───[ 💭 ᴍᴏᴠɪᴇ ʜᴜʙ 💭 ]───⍟</b>
"""
    LOG_TEXT_G = """🚩NewGroup🚩
Group = {}(<code>{}</code>)
Total Members = <code>{}</code>
Added By - {}
"""
    LOG_TEXT_P = """#𝐍𝐞𝐰𝐔𝐬𝐞𝐫
    
<b>᚛› 𝐈𝐃 - <code>{}</code></b>
<b>᚛› 𝐍𝐚𝐦𝐞 - {}</b>
<b>᚛› 𝓑𝓞𝓣 - {@}</b>
"""
